
var city = [
  {
    "id": "489",
    "value": "全国",
    "sub": [
      {
        "id": "530",
        "value": "北京"
      },
      {
        "id": "538",
        "value": "上海"
      },
      {
        "id": "531",
        "value": "天津"
      },
      {
        "id": "551",
        "value": "重庆"
      },
      {
        "id": "548",
        "value": "广东省",
        "sub": [
          {
            "id": "763",
            "value": "广州"
          },
          {
            "id": "765",
            "value": "深圳"
          },
          {
            "id": "773",
            "value": "惠州"
          },
          {
            "id": "768",
            "value": "佛山"
          },
          {
            "id": "764",
            "value": "韶关"
          },
          {
            "id": "766",
            "value": "珠海"
          },
          {
            "id": "767",
            "value": "汕头"
          },
          {
            "id": "769",
            "value": "江门"
          },
          {
            "id": "770",
            "value": "湛江"
          },
          {
            "id": "771",
            "value": "茂名"
          },
          {
            "id": "772",
            "value": "肇庆"
          },
          {
            "id": "774",
            "value": "梅州"
          },
          {
            "id": "775",
            "value": "汕尾"
          },
          {
            "id": "776",
            "value": "河源"
          },
          {
            "id": "777",
            "value": "阳江"
          },
          {
            "id": "778",
            "value": "清远"
          },
          {
            "id": "779",
            "value": "东莞"
          },
          {
            "id": "780",
            "value": "中山"
          },
          {
            "id": "781",
            "value": "潮州"
          },
          {
            "id": "782",
            "value": "揭阳"
          },
          {
            "id": "783",
            "value": "云浮"
          },
          {
            "id": "10112",
            "value": "台山"
          },
          {
            "id": "10113",
            "value": "普宁"
          },
          {
            "id": "10117",
            "value": "南沙开发区"
          },
          {
            "id": "10118",
            "value": "开平"
          },
          {
            "id": "10120",
            "value": "龙川"
          },
          {
            "id": "10138",
            "value": "鹤山"
          }
        ]
      },
      {
        "id": "546",
        "value": "湖北省",
        "sub": [
          {
            "id": "736",
            "value": "武汉"
          },
          {
            "id": "737",
            "value": "黄石"
          },
          {
            "id": "738",
            "value": "十堰"
          },
          {
            "id": "739",
            "value": "宜昌"
          },
          {
            "id": "740",
            "value": "襄阳"
          },
          {
            "id": "741",
            "value": "鄂州"
          },
          {
            "id": "742",
            "value": "荆门"
          },
          {
            "id": "743",
            "value": "孝感"
          },
          {
            "id": "744",
            "value": "荆州"
          },
          {
            "id": "745",
            "value": "黄冈"
          },
          {
            "id": "746",
            "value": "咸宁"
          },
          {
            "id": "747",
            "value": "随州"
          },
          {
            "id": "748",
            "value": "恩施土家族苗族自治州"
          },
          {
            "id": "10057",
            "value": "公安"
          },
          {
            "id": "10139",
            "value": "武穴"
          },
          {
            "id": "10140",
            "value": "天门"
          },
          {
            "id": "10168",
            "value": "仙桃"
          },
          {
            "id": "10169",
            "value": "潜江"
          },
          {
            "id": "10171",
            "value": "宜城"
          },
          {
            "id": "10179",
            "value": "神农架"
          }
        ]
      },
      {
        "id": "556",
        "value": "陕西省",
        "sub": [
          {
            "id": "854",
            "value": "西安"
          },
          {
            "id": "855",
            "value": "铜川"
          },
          {
            "id": "856",
            "value": "宝鸡"
          },
          {
            "id": "857",
            "value": "咸阳"
          },
          {
            "id": "858",
            "value": "渭南"
          },
          {
            "id": "859",
            "value": "延安"
          },
          {
            "id": "860",
            "value": "汉中"
          },
          {
            "id": "861",
            "value": "榆林"
          },
          {
            "id": "862",
            "value": "安康"
          },
          {
            "id": "863",
            "value": "商洛"
          },
          {
            "id": "10058",
            "value": "兴平"
          },
          {
            "id": "10470",
            "value": "杨凌"
          }
        ]
      },
      {
        "id": "552",
        "value": "四川省",
        "sub": [
          {
            "id": "801",
            "value": "成都"
          },
          {
            "id": "802",
            "value": "自贡"
          },
          {
            "id": "803",
            "value": "攀枝花"
          },
          {
            "id": "804",
            "value": "泸州"
          },
          {
            "id": "805",
            "value": "德阳"
          },
          {
            "id": "806",
            "value": "绵阳"
          },
          {
            "id": "807",
            "value": "广元"
          },
          {
            "id": "808",
            "value": "遂宁"
          },
          {
            "id": "809",
            "value": "内江"
          },
          {
            "id": "810",
            "value": "乐山"
          },
          {
            "id": "811",
            "value": "南充"
          },
          {
            "id": "812",
            "value": "眉山"
          },
          {
            "id": "813",
            "value": "宜宾"
          },
          {
            "id": "814",
            "value": "广安"
          },
          {
            "id": "815",
            "value": "达州"
          },
          {
            "id": "816",
            "value": "雅安"
          },
          {
            "id": "817",
            "value": "巴中"
          },
          {
            "id": "818",
            "value": "资阳"
          },
          {
            "id": "819",
            "value": "阿坝藏族羌族自治州"
          },
          {
            "id": "10201",
            "value": "简阳"
          },
          {
            "id": "820",
            "value": "甘孜藏族自治州"
          },
          {
            "id": "821",
            "value": "凉山彝族自治州"
          },
          {
            "id": "10065",
            "value": "峨眉"
          },
          {
            "id": "10104",
            "value": "西昌"
          }
        ]
      },
      {
        "id": "535",
        "value": "辽宁省",
        "sub": [
          {
            "id": "600",
            "value": "大连"
          },
          {
            "id": "599",
            "value": "沈阳"
          },
          {
            "id": "601",
            "value": "鞍山"
          },
          {
            "id": "602",
            "value": "抚顺"
          },
          {
            "id": "603",
            "value": "本溪"
          },
          {
            "id": "604",
            "value": "丹东"
          },
          {
            "id": "605",
            "value": "锦州"
          },
          {
            "id": "606",
            "value": "营口"
          },
          {
            "id": "607",
            "value": "阜新"
          },
          {
            "id": "608",
            "value": "辽阳"
          },
          {
            "id": "609",
            "value": "盘锦"
          },
          {
            "id": "610",
            "value": "铁岭"
          },
          {
            "id": "611",
            "value": "朝阳"
          },
          {
            "id": "612",
            "value": "葫芦岛"
          },
          {
            "id": "10023",
            "value": "兴城"
          },
          {
            "id": "10070",
            "value": "海城"
          },
          {
            "id": "10080",
            "value": "昌图"
          },
          {
            "id": "10144",
            "value": "开原"
          }
        ]
      },
      {
        "id": "536",
        "value": "吉林省",
        "sub": [
          {
            "id": "613",
            "value": "长春"
          },
          {
            "id": "614",
            "value": "吉林"
          },
          {
            "id": "615",
            "value": "四平"
          },
          {
            "id": "616",
            "value": "辽源"
          },
          {
            "id": "617",
            "value": "通化"
          },
          {
            "id": "618",
            "value": "白山"
          },
          {
            "id": "619",
            "value": "松原"
          },
          {
            "id": "620",
            "value": "白城"
          },
          {
            "id": "621",
            "value": "延边朝鲜族自治州"
          },
          {
            "id": "10122",
            "value": "公主岭"
          }
        ]
      },
      {
        "id": "539",
        "value": "江苏省",
        "sub": [
          {
            "id": "635",
            "value": "南京"
          },
          {
            "id": "639",
            "value": "苏州"
          },
          {
            "id": "636",
            "value": "无锡"
          },
          {
            "id": "640",
            "value": "昆山"
          },
          {
            "id": "650",
            "value": "常熟"
          },
          {
            "id": "652",
            "value": "张家港"
          },
          {
            "id": "651",
            "value": "江阴"
          },
          {
            "id": "637",
            "value": "徐州"
          },
          {
            "id": "638",
            "value": "常州"
          },
          {
            "id": "641",
            "value": "南通"
          },
          {
            "id": "642",
            "value": "连云港"
          },
          {
            "id": "643",
            "value": "淮安"
          },
          {
            "id": "644",
            "value": "盐城"
          },
          {
            "id": "645",
            "value": "扬州"
          },
          {
            "id": "646",
            "value": "镇江"
          },
          {
            "id": "647",
            "value": "泰州"
          },
          {
            "id": "649",
            "value": "靖江"
          },
          {
            "id": "648",
            "value": "宿迁"
          },
          {
            "id": "911",
            "value": "太仓"
          },
          {
            "id": "10028",
            "value": "句容"
          },
          {
            "id": "10049",
            "value": "宜兴"
          },
          {
            "id": "10051",
            "value": "如皋"
          },
          {
            "id": "10114",
            "value": "丹阳"
          },
          {
            "id": "10124",
            "value": "扬中"
          },
          {
            "id": "10126",
            "value": "高邮"
          },
          {
            "id": "10136",
            "value": "启东"
          },
          {
            "id": "10149",
            "value": "泰兴"
          },
          {
            "id": "10150",
            "value": "溧阳"
          },
          {
            "id": "10152",
            "value": "盱眙"
          },
          {
            "id": "10155",
            "value": "通州"
          },
          {
            "id": "10175",
            "value": "金湖"
          }
        ]
      },
      {
        "id": "544",
        "value": "山东省",
        "sub": [
          {
            "id": "702",
            "value": "济南"
          },
          {
            "id": "703",
            "value": "青岛"
          },
          {
            "id": "707",
            "value": "烟台"
          },
          {
            "id": "704",
            "value": "淄博"
          },
          {
            "id": "705",
            "value": "枣庄"
          },
          {
            "id": "706",
            "value": "东营"
          },
          {
            "id": "708",
            "value": "潍坊"
          },
          {
            "id": "709",
            "value": "济宁"
          },
          {
            "id": "710",
            "value": "泰安"
          },
          {
            "id": "711",
            "value": "威海"
          },
          {
            "id": "712",
            "value": "日照"
          },
          {
            "id": "713",
            "value": "莱芜"
          },
          {
            "id": "714",
            "value": "临沂"
          },
          {
            "id": "715",
            "value": "德州"
          },
          {
            "id": "716",
            "value": "聊城"
          },
          {
            "id": "717",
            "value": "滨州"
          },
          {
            "id": "718",
            "value": "菏泽"
          },
          {
            "id": "912",
            "value": "荣成"
          },
          {
            "id": "10026",
            "value": "黄岛"
          },
          {
            "id": "10060",
            "value": "乳山"
          },
          {
            "id": "10096",
            "value": "城阳"
          },
          {
            "id": "10097",
            "value": "即墨"
          },
          {
            "id": "10099",
            "value": "肥城"
          },
          {
            "id": "10116",
            "value": "兖州"
          },
          {
            "id": "10146",
            "value": "海阳"
          },
          {
            "id": "10156",
            "value": "胶州"
          },
          {
            "id": "10172",
            "value": "胶南"
          },
          {
            "id": "10173",
            "value": "平度"
          },
          {
            "id": "10174",
            "value": "莱西"
          }
        ]
      },
      {
        "id": "540",
        "value": "浙江省",
        "sub": [
          {
            "id": "653",
            "value": "杭州"
          },
          {
            "id": "654",
            "value": "宁波"
          },
          {
            "id": "655",
            "value": "温州"
          },
          {
            "id": "656",
            "value": "嘉兴"
          },
          {
            "id": "657",
            "value": "湖州"
          },
          {
            "id": "658",
            "value": "绍兴"
          },
          {
            "id": "659",
            "value": "金华"
          },
          {
            "id": "660",
            "value": "衢州"
          },
          {
            "id": "661",
            "value": "舟山"
          },
          {
            "id": "662",
            "value": "台州"
          },
          {
            "id": "663",
            "value": "丽水"
          },
          {
            "id": "909",
            "value": "玉环县"
          },
          {
            "id": "10004",
            "value": "义乌"
          },
          {
            "id": "10052",
            "value": "平湖"
          },
          {
            "id": "10055",
            "value": "永康"
          },
          {
            "id": "10056",
            "value": "东阳"
          },
          {
            "id": "10067",
            "value": "嘉善"
          },
          {
            "id": "10085",
            "value": "余姚"
          },
          {
            "id": "10086",
            "value": "慈溪"
          },
          {
            "id": "10089",
            "value": "乐清"
          },
          {
            "id": "10091",
            "value": "永嘉"
          },
          {
            "id": "10127",
            "value": "桐乡"
          },
          {
            "id": "10128",
            "value": "瑞安"
          },
          {
            "id": "10129",
            "value": "温岭"
          },
          {
            "id": "10130",
            "value": "上虞"
          },
          {
            "id": "10131",
            "value": "诸暨"
          },
          {
            "id": "10133",
            "value": "海宁"
          },
          {
            "id": "10134",
            "value": "宁海"
          },
          {
            "id": "10145",
            "value": "三门"
          },
          {
            "id": "10151",
            "value": "德清"
          },
          {
            "id": "10154",
            "value": "象山"
          },
          {
            "id": "10158",
            "value": "方家山"
          },
          {
            "id": "10180",
            "value": "龙泉"
          }
        ]
      },
      {
        "id": "549",
        "value": "广西壮族自治区",
        "sub": [
          {
            "id": "785",
            "value": "南宁"
          },
          {
            "id": "786",
            "value": "柳州"
          },
          {
            "id": "787",
            "value": "桂林"
          },
          {
            "id": "788",
            "value": "梧州"
          },
          {
            "id": "789",
            "value": "北海"
          },
          {
            "id": "790",
            "value": "防城港"
          },
          {
            "id": "791",
            "value": "钦州"
          },
          {
            "id": "792",
            "value": "贵港"
          },
          {
            "id": "793",
            "value": "玉林"
          },
          {
            "id": "794",
            "value": "百色"
          },
          {
            "id": "795",
            "value": "贺州"
          },
          {
            "id": "796",
            "value": "河池"
          },
          {
            "id": "904",
            "value": "来宾"
          },
          {
            "id": "905",
            "value": "崇左"
          }
        ]
      },
      {
        "id": "541",
        "value": "安徽省",
        "sub": [
          {
            "id": "664",
            "value": "合肥"
          },
          {
            "id": "665",
            "value": "芜湖"
          },
          {
            "id": "666",
            "value": "蚌埠"
          },
          {
            "id": "667",
            "value": "淮南"
          },
          {
            "id": "668",
            "value": "马鞍山"
          },
          {
            "id": "669",
            "value": "淮北"
          },
          {
            "id": "670",
            "value": "铜陵"
          },
          {
            "id": "671",
            "value": "安庆"
          },
          {
            "id": "672",
            "value": "黄山"
          },
          {
            "id": "673",
            "value": "滁州"
          },
          {
            "id": "674",
            "value": "阜阳"
          },
          {
            "id": "675",
            "value": "宿州"
          },
          {
            "id": "676",
            "value": "巢湖"
          },
          {
            "id": "677",
            "value": "六安"
          },
          {
            "id": "678",
            "value": "亳州"
          },
          {
            "id": "679",
            "value": "池州"
          },
          {
            "id": "680",
            "value": "宣城"
          },
          {
            "id": "10069",
            "value": "凤阳"
          },
          {
            "id": "10181",
            "value": "广德"
          },
          {
            "id": "10182",
            "value": "宿松"
          }
        ]
      },
      {
        "id": "532",
        "value": "河北省",
        "sub": [
          {
            "id": "565",
            "value": "石家庄"
          },
          {
            "id": "566",
            "value": "唐山"
          },
          {
            "id": "567",
            "value": "秦皇岛"
          },
          {
            "id": "568",
            "value": "邯郸"
          },
          {
            "id": "569",
            "value": "邢台"
          },
          {
            "id": "570",
            "value": "保定"
          },
          {
            "id": "571",
            "value": "张家口"
          },
          {
            "id": "572",
            "value": "承德"
          },
          {
            "id": "573",
            "value": "沧州"
          },
          {
            "id": "574",
            "value": "廊坊"
          },
          {
            "id": "575",
            "value": "衡水"
          },
          {
            "id": "10050",
            "value": "燕郊开发区"
          },
          {
            "id": "10142",
            "value": "固安"
          },
          {
            "id": "10143",
            "value": "遵化"
          },
          {
            "id": "10167",
            "value": "香河"
          },
          {
            "id": "10170",
            "value": "三河"
          }
        ]
      },
      {
        "id": "533",
        "value": "山西省",
        "sub": [
          {
            "id": "576",
            "value": "太原"
          },
          {
            "id": "577",
            "value": "大同"
          },
          {
            "id": "578",
            "value": "阳泉"
          },
          {
            "id": "579",
            "value": "长治"
          },
          {
            "id": "580",
            "value": "晋城"
          },
          {
            "id": "581",
            "value": "朔州"
          },
          {
            "id": "582",
            "value": "晋中"
          },
          {
            "id": "583",
            "value": "运城"
          },
          {
            "id": "584",
            "value": "忻州"
          },
          {
            "id": "585",
            "value": "临汾"
          },
          {
            "id": "586",
            "value": "吕梁"
          },
          {
            "id": "910",
            "value": "永济"
          },
          {
            "id": "10082",
            "value": "和顺"
          }
        ]
      },
      {
        "id": "534",
        "value": "内蒙古自治区",
        "sub": [
          {
            "id": "587",
            "value": "呼和浩特"
          },
          {
            "id": "588",
            "value": "包头"
          },
          {
            "id": "589",
            "value": "乌海"
          },
          {
            "id": "590",
            "value": "赤峰"
          },
          {
            "id": "591",
            "value": "通辽"
          },
          {
            "id": "592",
            "value": "鄂尔多斯"
          },
          {
            "id": "593",
            "value": "呼伦贝尔"
          },
          {
            "id": "594",
            "value": "兴安盟"
          },
          {
            "id": "595",
            "value": "锡林郭勒盟"
          },
          {
            "id": "596",
            "value": "乌兰察布"
          },
          {
            "id": "597",
            "value": "巴彦淖尔"
          },
          {
            "id": "598",
            "value": "阿拉善盟"
          },
          {
            "id": "10031",
            "value": "乌审旗"
          },
          {
            "id": "10157",
            "value": "满洲里"
          }
        ]
      },
      {
        "id": "537",
        "value": "黑龙江省",
        "sub": [
          {
            "id": "622",
            "value": "哈尔滨"
          },
          {
            "id": "623",
            "value": "齐齐哈尔"
          },
          {
            "id": "624",
            "value": "鸡西"
          },
          {
            "id": "625",
            "value": "鹤岗"
          },
          {
            "id": "626",
            "value": "双鸭山"
          },
          {
            "id": "627",
            "value": "大庆"
          },
          {
            "id": "628",
            "value": "伊春"
          },
          {
            "id": "629",
            "value": "佳木斯"
          },
          {
            "id": "630",
            "value": "七台河"
          },
          {
            "id": "631",
            "value": "牡丹江"
          },
          {
            "id": "632",
            "value": "黑河"
          },
          {
            "id": "633",
            "value": "绥化"
          },
          {
            "id": "634",
            "value": "大兴安岭"
          },
          {
            "id": "10081",
            "value": "安达"
          },
          {
            "id": "10159",
            "value": "双城"
          },
          {
            "id": "10160",
            "value": "尚志"
          },
          {
            "id": "10161",
            "value": "绥芬河"
          },
          {
            "id": "10510",
            "value": "肇东"
          }
        ]
      },
      {
        "id": "542",
        "value": "福建省",
        "sub": [
          {
            "id": "681",
            "value": "福州"
          },
          {
            "id": "682",
            "value": "厦门"
          },
          {
            "id": "683",
            "value": "莆田"
          },
          {
            "id": "684",
            "value": "三明"
          },
          {
            "id": "685",
            "value": "泉州"
          },
          {
            "id": "686",
            "value": "泉港区"
          },
          {
            "id": "687",
            "value": "漳州"
          },
          {
            "id": "688",
            "value": "南平"
          },
          {
            "id": "689",
            "value": "龙岩"
          },
          {
            "id": "690",
            "value": "宁德"
          },
          {
            "id": "10020",
            "value": "福安"
          },
          {
            "id": "10148",
            "value": "晋江"
          }
        ]
      },
      {
        "id": "543",
        "value": "江西省",
        "sub": [
          {
            "id": "691",
            "value": "南昌"
          },
          {
            "id": "692",
            "value": "景德镇"
          },
          {
            "id": "693",
            "value": "萍乡"
          },
          {
            "id": "694",
            "value": "九江"
          },
          {
            "id": "695",
            "value": "新余"
          },
          {
            "id": "696",
            "value": "鹰潭"
          },
          {
            "id": "697",
            "value": "赣州"
          },
          {
            "id": "698",
            "value": "吉安"
          },
          {
            "id": "699",
            "value": "宜春"
          },
          {
            "id": "700",
            "value": "抚州"
          },
          {
            "id": "701",
            "value": "上饶"
          }
        ]
      },
      {
        "id": "545",
        "value": "河南省",
        "sub": [
          {
            "id": "719",
            "value": "郑州"
          },
          {
            "id": "720",
            "value": "开封"
          },
          {
            "id": "721",
            "value": "洛阳"
          },
          {
            "id": "722",
            "value": "平顶山"
          },
          {
            "id": "723",
            "value": "安阳"
          },
          {
            "id": "724",
            "value": "鹤壁"
          },
          {
            "id": "725",
            "value": "新乡"
          },
          {
            "id": "726",
            "value": "焦作"
          },
          {
            "id": "727",
            "value": "濮阳"
          },
          {
            "id": "728",
            "value": "许昌"
          },
          {
            "id": "729",
            "value": "漯河"
          },
          {
            "id": "730",
            "value": "三门峡"
          },
          {
            "id": "731",
            "value": "南阳"
          },
          {
            "id": "732",
            "value": "商丘"
          },
          {
            "id": "733",
            "value": "信阳"
          },
          {
            "id": "734",
            "value": "周口"
          },
          {
            "id": "735",
            "value": "驻马店"
          },
          {
            "id": "10044",
            "value": "济源"
          },
          {
            "id": "10059",
            "value": "西平"
          },
          {
            "id": "10137",
            "value": "长葛"
          }
        ]
      },
      {
        "id": "547",
        "value": "湖南省",
        "sub": [
          {
            "id": "749",
            "value": "长沙"
          },
          {
            "id": "750",
            "value": "株洲"
          },
          {
            "id": "751",
            "value": "湘潭"
          },
          {
            "id": "752",
            "value": "衡阳"
          },
          {
            "id": "753",
            "value": "邵阳"
          },
          {
            "id": "754",
            "value": "岳阳"
          },
          {
            "id": "755",
            "value": "常德"
          },
          {
            "id": "756",
            "value": "张家界"
          },
          {
            "id": "757",
            "value": "益阳"
          },
          {
            "id": "758",
            "value": "郴州"
          },
          {
            "id": "759",
            "value": "永州"
          },
          {
            "id": "760",
            "value": "怀化"
          },
          {
            "id": "761",
            "value": "娄底"
          },
          {
            "id": "762",
            "value": "湘西土家族苗族自治州"
          }
        ]
      },
      {
        "id": "550",
        "value": "海南省",
        "sub": [
          {
            "id": "799",
            "value": "海口"
          },
          {
            "id": "800",
            "value": "三亚"
          },
          {
            "id": "907",
            "value": "洋浦市/洋浦经济开发区"
          },
          {
            "id": "10153",
            "value": "琼海"
          },
          {
            "id": "10183",
            "value": "儋州"
          },
          {
            "id": "10184",
            "value": "五指山"
          },
          {
            "id": "10185",
            "value": "文昌"
          },
          {
            "id": "10186",
            "value": "万宁"
          },
          {
            "id": "10187",
            "value": "东方"
          },
          {
            "id": "10188",
            "value": "定安"
          },
          {
            "id": "10189",
            "value": "屯昌"
          },
          {
            "id": "10190",
            "value": "澄迈"
          },
          {
            "id": "10191",
            "value": "临高"
          },
          {
            "id": "10192",
            "value": "琼中黎族苗族自治县"
          },
          {
            "id": "10193",
            "value": "保亭黎族苗族自治县"
          },
          {
            "id": "10194",
            "value": "白沙黎族自治县"
          },
          {
            "id": "10195",
            "value": "昌江黎族自治县"
          },
          {
            "id": "10196",
            "value": "乐东黎族自治县"
          },
          {
            "id": "10197",
            "value": "陵水黎族自治县"
          },
          {
            "id": "10303",
            "value": "三沙"
          }
        ]
      },
      {
        "id": "553",
        "value": "贵州省",
        "sub": [
          {
            "id": "822",
            "value": "贵阳"
          },
          {
            "id": "823",
            "value": "六盘水"
          },
          {
            "id": "824",
            "value": "遵义"
          },
          {
            "id": "825",
            "value": "安顺"
          },
          {
            "id": "826",
            "value": "铜仁"
          },
          {
            "id": "827",
            "value": "黔西南布依族苗族自治州"
          },
          {
            "id": "828",
            "value": "毕节"
          },
          {
            "id": "829",
            "value": "黔东南苗族侗族自治州"
          },
          {
            "id": "830",
            "value": "黔南布依族苗族自治州"
          }
        ]
      },
      {
        "id": "554",
        "value": "云南省",
        "sub": [
          {
            "id": "831",
            "value": "昆明"
          },
          {
            "id": "832",
            "value": "曲靖"
          },
          {
            "id": "833",
            "value": "玉溪"
          },
          {
            "id": "834",
            "value": "保山"
          },
          {
            "id": "835",
            "value": "昭通"
          },
          {
            "id": "836",
            "value": "楚雄彝族自治州"
          },
          {
            "id": "837",
            "value": "红河哈尼族彝族自治州"
          },
          {
            "id": "838",
            "value": "文山壮族苗族自治州"
          },
          {
            "id": "839",
            "value": "思茅"
          },
          {
            "id": "840",
            "value": "西双版纳傣族自治州"
          },
          {
            "id": "841",
            "value": "大理白族自治州"
          },
          {
            "id": "842",
            "value": "德宏傣族景颇族自治州"
          },
          {
            "id": "843",
            "value": "丽江"
          },
          {
            "id": "844",
            "value": "怒江傈僳族自治州"
          },
          {
            "id": "845",
            "value": "迪庆藏族自治州"
          },
          {
            "id": "846",
            "value": "临沧"
          },
          {
            "id": "10163",
            "value": "普洱"
          }
        ]
      },
      {
        "id": "555",
        "value": "西藏自治区",
        "sub": [
          {
            "id": "847",
            "value": "拉萨"
          },
          {
            "id": "848",
            "value": "昌都"
          },
          {
            "id": "849",
            "value": "山南"
          },
          {
            "id": "850",
            "value": "日喀则"
          },
          {
            "id": "851",
            "value": "那曲"
          },
          {
            "id": "852",
            "value": "阿里"
          },
          {
            "id": "853",
            "value": "林芝"
          }
        ]
      },
      {
        "id": "557",
        "value": "甘肃省",
        "sub": [
          {
            "id": "864",
            "value": "兰州"
          },
          {
            "id": "865",
            "value": "嘉峪关"
          },
          {
            "id": "866",
            "value": "金昌"
          },
          {
            "id": "867",
            "value": "白银"
          },
          {
            "id": "868",
            "value": "天水"
          },
          {
            "id": "869",
            "value": "武威"
          },
          {
            "id": "870",
            "value": "张掖"
          },
          {
            "id": "871",
            "value": "平凉"
          },
          {
            "id": "872",
            "value": "酒泉"
          },
          {
            "id": "873",
            "value": "庆阳"
          },
          {
            "id": "874",
            "value": "定西"
          },
          {
            "id": "875",
            "value": "陇南"
          },
          {
            "id": "876",
            "value": "临夏回族自治州"
          },
          {
            "id": "877",
            "value": "甘南藏族自治州"
          }
        ]
      },
      {
        "id": "558",
        "value": "青海省",
        "sub": [
          {
            "id": "878",
            "value": "西宁"
          },
          {
            "id": "879",
            "value": "海东"
          },
          {
            "id": "880",
            "value": "海北藏族自治州"
          },
          {
            "id": "881",
            "value": "黄南藏族自治州"
          },
          {
            "id": "882",
            "value": "海南藏族自治州"
          },
          {
            "id": "883",
            "value": "果洛藏族自治州"
          },
          {
            "id": "884",
            "value": "玉树藏族自治州"
          },
          {
            "id": "885",
            "value": "海西蒙古族藏族自治州"
          }
        ]
      },
      {
        "id": "559",
        "value": "宁夏回族自治区",
        "sub": [
          {
            "id": "886",
            "value": "银川"
          },
          {
            "id": "887",
            "value": "石嘴山"
          },
          {
            "id": "888",
            "value": "吴忠"
          },
          {
            "id": "889",
            "value": "固原"
          },
          {
            "id": "906",
            "value": "中卫"
          }
        ]
      },
      {
        "id": "560",
        "value": "新疆维吾尔自治区",
        "sub": [
          {
            "id": "890",
            "value": "乌鲁木齐"
          },
          {
            "id": "891",
            "value": "克拉玛依"
          },
          {
            "id": "892",
            "value": "吐鲁番"
          },
          {
            "id": "893",
            "value": "哈密"
          },
          {
            "id": "894",
            "value": "昌吉回族自治州"
          },
          {
            "id": "895",
            "value": "博尔塔拉蒙古自治州"
          },
          {
            "id": "896",
            "value": "巴音郭楞蒙古自治州"
          },
          {
            "id": "897",
            "value": "阿克苏"
          },
          {
            "id": "898",
            "value": "克孜勒苏柯尔克孜自治州"
          },
          {
            "id": "899",
            "value": "喀什"
          },
          {
            "id": "900",
            "value": "和田"
          },
          {
            "id": "901",
            "value": "伊犁哈萨克自治州"
          },
          {
            "id": "902",
            "value": "塔城"
          },
          {
            "id": "903",
            "value": "阿勒泰"
          },
          {
            "id": "10061",
            "value": "石河子"
          },
          {
            "id": "10164",
            "value": "奎屯"
          },
          {
            "id": "10166",
            "value": "乌苏"
          },
          {
            "id": "10176",
            "value": "阿拉尔"
          },
          {
            "id": "10177",
            "value": "图木舒克"
          },
          {
            "id": "10178",
            "value": "五家渠"
          },
          {
            "id": "10300",
            "value": "北屯"
          },
          {
            "id": "10301",
            "value": "双河"
          },
          {
            "id": "10302",
            "value": "铁门关"
          }
        ]
      },
      {
        "id": "561",
        "value": "香港特别行政区"
      },
      {
        "id": "562",
        "value": "澳门特别行政区"
      },
      {
        "id": "563",
        "value": "台湾省",
        "sub": [
          {
            "id": "10304",
            "value": "台北"
          }
        ]
      }
    ]
  },
  {
    "id": "0",
    "value": "国外",
    "sub": [
      {
        "id": "480",
        "value": "国外"
      },
      {
        "id": "481",
        "value": "阿根廷"
      },
      {
        "id": "482",
        "value": "澳大利亚"
      },
      {
        "id": "483",
        "value": "奥地利"
      },
      {
        "id": "484",
        "value": "白俄罗斯"
      },
      {
        "id": "485",
        "value": "比利时"
      },
      {
        "id": "486",
        "value": "巴西"
      },
      {
        "id": "487",
        "value": "保加利亚"
      },
      {
        "id": "488",
        "value": "加拿大"
      },
      {
        "id": "490",
        "value": "塞浦路斯"
      },
      {
        "id": "491",
        "value": "捷克"
      },
      {
        "id": "492",
        "value": "丹麦"
      },
      {
        "id": "493",
        "value": "埃及"
      },
      {
        "id": "494",
        "value": "芬兰"
      },
      {
        "id": "495",
        "value": "法国"
      },
      {
        "id": "496",
        "value": "德国"
      },
      {
        "id": "497",
        "value": "希腊"
      },
      {
        "id": "498",
        "value": "匈牙利"
      },
      {
        "id": "499",
        "value": "冰岛"
      },
      {
        "id": "500",
        "value": "印度"
      },
      {
        "id": "501",
        "value": "印度尼西亚"
      },
      {
        "id": "502",
        "value": "爱尔兰"
      },
      {
        "id": "503",
        "value": "以色列"
      },
      {
        "id": "504",
        "value": "意大利"
      },
      {
        "id": "505",
        "value": "日本"
      },
      {
        "id": "506",
        "value": "韩国"
      },
      {
        "id": "507",
        "value": "科威特"
      },
      {
        "id": "508",
        "value": "马来西亚"
      },
      {
        "id": "509",
        "value": "荷兰"
      },
      {
        "id": "510",
        "value": "新西兰"
      },
      {
        "id": "511",
        "value": "挪威"
      },
      {
        "id": "513",
        "value": "巴基斯坦"
      },
      {
        "id": "514",
        "value": "波兰"
      },
      {
        "id": "515",
        "value": "葡萄牙"
      },
      {
        "id": "516",
        "value": "俄罗斯联邦"
      },
      {
        "id": "517",
        "value": "沙特阿拉伯"
      },
      {
        "id": "518",
        "value": "新加坡"
      },
      {
        "id": "519",
        "value": "南非"
      },
      {
        "id": "520",
        "value": "西班牙"
      },
      {
        "id": "521",
        "value": "瑞典"
      },
      {
        "id": "522",
        "value": "瑞士"
      },
      {
        "id": "523",
        "value": "泰国"
      },
      {
        "id": "524",
        "value": "土耳其"
      },
      {
        "id": "525",
        "value": "乌克兰"
      },
      {
        "id": "526",
        "value": "阿联酋"
      },
      {
        "id": "527",
        "value": "英国"
      },
      {
        "id": "528",
        "value": "美国"
      },
      {
        "id": "529",
        "value": "越南"
      },
      {
        "id": "913",
        "value": "安哥拉"
      },
      {
        "id": "914",
        "value": "加纳"
      },
      {
        "id": "915",
        "value": "尼日利亚"
      },
      {
        "id": "916",
        "value": "坦桑尼亚"
      },
      {
        "id": "917",
        "value": "乌干达"
      },
      {
        "id": "918",
        "value": "阿尔及利亚"
      },
      {
        "id": "919",
        "value": "塞内加尔"
      },
      {
        "id": "925",
        "value": "黎巴嫩"
      },
      {
        "id": "512",
        "value": "其他"
      },
      {
        "id": "942",
        "value": "委内瑞拉"
      },
      {
        "id": "922",
        "value": "哥伦比亚"
      },
      {
        "id": "928",
        "value": "斯洛文尼亚"
      },
      {
        "id": "931",
        "value": "智利"
      },
      {
        "id": "939",
        "value": "秘鲁"
      },
      {
        "id": "923",
        "value": "哈萨克斯坦"
      },
      {
        "id": "934",
        "value": "巴林"
      },
      {
        "id": "940",
        "value": "塞尔维亚"
      },
      {
        "id": "926",
        "value": "立陶宛"
      },
      {
        "id": "920",
        "value": "爱沙尼亚"
      },
      {
        "id": "937",
        "value": "罗马尼亚"
      },
      {
        "id": "943",
        "value": "伊拉克"
      },
      {
        "id": "938",
        "value": "孟加拉国"
      },
      {
        "id": "929",
        "value": "乌拉圭"
      },
      {
        "id": "941",
        "value": "斯里兰卡"
      },
      {
        "id": "935",
        "value": "波多黎各"
      },
      {
        "id": "927",
        "value": "墨西哥"
      },
      {
        "id": "921",
        "value": "菲律宾"
      },
      {
        "id": "944",
        "value": "约旦"
      },
      {
        "id": "930",
        "value": "伊朗"
      },
      {
        "id": "936",
        "value": "卡塔尔"
      },
      {
        "id": "924",
        "value": "克罗地亚"
      },
      {
        "id": "933",
        "value": "阿塞拜疆"
      }
    ]
  }
];
var hotCity = [{
  "id": "489",
  "value": "全国",
  "sub": [{
    "id": "530",
    "value": "北京"
  }, {
    "id": "538",
    "value": "上海"
  }, {
    "id": "531",
    "value": "天津"
  }, {
    "id": "551",
    "value": "重庆"
  }]
}, {
  "id": "548",
  "value": "广东",
  "sub": [{
    "id": "763",
    "value": "广州"
  }, {
    "id": "765",
    "value": "深圳"
  }, {
    "id": "773",
    "value": "惠州"
  }, {
    "id": "768",
    "value": "佛山"
  }]
}, {
  "id": "546",
  "value": "湖北",
  "sub": [{
    "id": "736",
    "value": "武汉"
  }]
}, {
  "id": "556",
  "value": "陕西",
  "sub": [{
    "id": "854",
    "value": "西安"
  }]
}, {
  "id": "552",
  "value": "四川",
  "sub": [{
    "id": "801",
    "value": "成都"
  }]
}, {
  "id": "535",
  "value": "辽宁",
  "sub": [{
    "id": "600",
    "value": "大连"
  }, {
    "id": "599",
    "value": "沈阳"
  }]
}, {
  "id": "536",
  "value": "吉林",
  "sub": [{
    "id": "613",
    "value": "长春"
  }]
}, {
  "id": "539",
  "value": "江苏",
  "sub": [{
    "id": "635",
    "value": "南京"
  }, {
    "id": "639",
    "value": "苏州"
  }, {
    "id": "636",
    "value": "无锡"
  }]
}, {
  "id": "544",
  "value": "山东",
  "sub": [{
    "id": "702",
    "value": "济南"
  }, {
    "id": "703",
    "value": "青岛"
  }, {
    "id": "707",
    "value": "烟台"
  }]
}, {
  "id": "540",
  "value": "浙江",
  "sub": [{
    "id": "653",
    "value": "杭州"
  }, {
    "id": "654",
    "value": "宁波"
  }]
}, {
  "id": "545",
  "value": "河南",
  "sub": [{
    "id": "719",
    "value": "郑州"
  }]
}, {
  "id": "547",
  "value": "湖南",
  "sub": [{
    "id": "749",
    "value": "长沙"
  }]
}, {
  "id": "542",
  "value": "福建",
  "sub": [{
    "id": "681",
    "value": "福州"
  }, {
    "id": "682",
    "value": "厦门"
  }]
}, {
  "id": "537",
  "value": "黑龙江",
  "sub": [{
    "id": "622",
    "value": "哈尔滨"
  }]
}, {
  "id": "532",
  "value": "河北",
  "sub": [{
    "id": "565",
    "value": "石家庄"
  }]
}, {
  "id": "541",
  "value": "安徽",
  "sub": [{
    "id": "664",
    "value": "合肥"
  }]
}, {
  "id": "533",
  "value": "山西",
  "sub": [{
    "id": "576",
    "value": "太原"
  }]
}, {
  "id": "554",
  "value": "云南",
  "sub": [{
    "id": "831",
    "value": "昆明"
  }]
}, {
  "id": "543",
  "value": "江西",
  "sub": [{
    "id": "691",
    "value": "南昌"
  }]
}, {
  "id": "553",
  "value": "贵州",
  "sub": [{
    "id": "822",
    "value": "贵阳"
  }]
}];

var city_en = [
  {
    "id": "489",
    "value": "China",
    "sub": [
      {
        "id": "530",
        "value": "BEIJING"
      },
      {
        "id": "538",
        "value": "SHANGHAI"
      },
      {
        "id": "531",
        "value": "TIANJIN"
      },
      {
        "id": "551",
        "value": "CHONGQING"
      },
      {
        "id": "548",
        "value": "GUANGDONG",
        "sub": [
          {
            "id": "763",
            "value": "GUANGZHOU"
          },
          {
            "id": "765",
            "value": "SHENZHEN"
          },
          {
            "id": "773",
            "value": "HUIZHOU"
          },
          {
            "id": "768",
            "value": "FOSHAN"
          },
          {
            "id": "764",
            "value": "SHAOGUAN"
          },
          {
            "id": "766",
            "value": "ZHUHAI"
          },
          {
            "id": "767",
            "value": "SHANTOU"
          },
          {
            "id": "769",
            "value": "JIANGMEN"
          },
          {
            "id": "770",
            "value": "ZHANJIANG"
          },
          {
            "id": "771",
            "value": "MAOMING"
          },
          {
            "id": "772",
            "value": "ZHAOQING"
          },
          {
            "id": "774",
            "value": "MEIZHOU"
          },
          {
            "id": "775",
            "value": "SHANWEI"
          },
          {
            "id": "776",
            "value": "HEYUAN"
          },
          {
            "id": "777",
            "value": "YANGJIANG"
          },
          {
            "id": "778",
            "value": "QINGYUAN"
          },
          {
            "id": "779",
            "value": "DONGGUAN"
          },
          {
            "id": "780",
            "value": "ZHONGSHAN"
          },
          {
            "id": "781",
            "value": "CHAOZHOU"
          },
          {
            "id": "782",
            "value": "JIEYANG"
          },
          {
            "id": "783",
            "value": "YUNFU"
          },
          {
            "id": "10112",
            "value": "TAISHAN"
          },
          {
            "id": "10113",
            "value": "PUNING"
          },
          {
            "id": "10117",
            "value": "NANSHA"
          },
          {
            "id": "10118",
            "value": "KAIPING"
          },
          {
            "id": "10120",
            "value": "LONGCHUAN"
          },
          {
            "id": "10138",
            "value": "HESHAN"
          }
        ]
      },
      {
        "id": "546",
        "value": "HUBEI",
        "sub": [
          {
            "id": "736",
            "value": "WUHAN"
          },
          {
            "id": "737",
            "value": "HUANGSHI"
          },
          {
            "id": "738",
            "value": "SHIYAN"
          },
          {
            "id": "739",
            "value": "YICHANG"
          },
          {
            "id": "740",
            "value": "XIANGYANG"
          },
          {
            "id": "741",
            "value": "EZHOU"
          },
          {
            "id": "742",
            "value": "JINGMEN"
          },
          {
            "id": "743",
            "value": "XIAOGAN"
          },
          {
            "id": "744",
            "value": "JINGZHOU"
          },
          {
            "id": "745",
            "value": "HUANGGANG"
          },
          {
            "id": "746",
            "value": "XIANNING"
          },
          {
            "id": "747",
            "value": "SUIZHOU"
          },
          {
            "id": "748",
            "value": "ENSHITUJIAZUMIAOZUZIZHIZHOU"
          },
          {
            "id": "10057",
            "value": "GONGAN"
          },
          {
            "id": "10139",
            "value": "WUXUE"
          },
          {
            "id": "10140",
            "value": "TIANMEN"
          },
          {
            "id": "10168",
            "value": "XIANTAO"
          },
          {
            "id": "10169",
            "value": "QIANJIANG"
          },
          {
            "id": "10171",
            "value": "YICHENG"
          },
          {
            "id": "10179",
            "value": "SHENNONGJIA"
          }
        ]
      },
      {
        "id": "556",
        "value": "SHAANXI",
        "sub": [
          {
            "id": "854",
            "value": "XIAN"
          },
          {
            "id": "855",
            "value": "TONGCHUAN"
          },
          {
            "id": "856",
            "value": "BAOJI"
          },
          {
            "id": "857",
            "value": "XIANYANG"
          },
          {
            "id": "858",
            "value": "WEINAN"
          },
          {
            "id": "859",
            "value": "YANAN"
          },
          {
            "id": "860",
            "value": "HANZHONG"
          },
          {
            "id": "861",
            "value": "YULIN"
          },
          {
            "id": "862",
            "value": "ANKANG"
          },
          {
            "id": "863",
            "value": "SHANGLUO"
          },
          {
            "id": "10058",
            "value": "XINGPING"
          },
          {
            "id": "10470",
            "value": "Yangling"
          }
        ]
      },
      {
        "id": "552",
        "value": "SICHUAN",
        "sub": [
          {
            "id": "801",
            "value": "CHENGDU"
          },
          {
            "id": "802",
            "value": "ZIGONG"
          },
          {
            "id": "803",
            "value": "PANZHIHUA"
          },
          {
            "id": "804",
            "value": "LUZHOU"
          },
          {
            "id": "805",
            "value": "DEYANG"
          },
          {
            "id": "806",
            "value": "MIANYANG"
          },
          {
            "id": "807",
            "value": "GUANGYUAN"
          },
          {
            "id": "808",
            "value": "SUINING"
          },
          {
            "id": "809",
            "value": "NEIJIANG"
          },
          {
            "id": "810",
            "value": "LESHAN"
          },
          {
            "id": "811",
            "value": "NANCHONG"
          },
          {
            "id": "812",
            "value": "MEISHAN"
          },
          {
            "id": "813",
            "value": "YIBIN"
          },
          {
            "id": "814",
            "value": "GUANGAN"
          },
          {
            "id": "815",
            "value": "DAZHOU"
          },
          {
            "id": "816",
            "value": "YAAN"
          },
          {
            "id": "817",
            "value": "BAZHONG"
          },
          {
            "id": "818",
            "value": "ZIYANG"
          },
          {
            "id": "819",
            "value": "ABA"
          },
          {
            "id": "10201",
            "value": "JIANYANG"
          },
          {
            "id": "820",
            "value": "GANZI"
          },
          {
            "id": "821",
            "value": "LIANGSHAN"
          },
          {
            "id": "10065",
            "value": "EMEI"
          },
          {
            "id": "10104",
            "value": "XICHANG"
          }
        ]
      },
      {
        "id": "535",
        "value": "LIAONING",
        "sub": [
          {
            "id": "600",
            "value": "DALIAN"
          },
          {
            "id": "599",
            "value": "SHENYANG"
          },
          {
            "id": "601",
            "value": "ANSHAN"
          },
          {
            "id": "602",
            "value": "FUSHUN"
          },
          {
            "id": "603",
            "value": "BENXI"
          },
          {
            "id": "604",
            "value": "DANDONG"
          },
          {
            "id": "605",
            "value": "JINZHOU"
          },
          {
            "id": "606",
            "value": "YINGKOU"
          },
          {
            "id": "607",
            "value": "FUXIN"
          },
          {
            "id": "608",
            "value": "LIAOYANG"
          },
          {
            "id": "609",
            "value": "PANJIN"
          },
          {
            "id": "610",
            "value": "TIELING"
          },
          {
            "id": "611",
            "value": "CHAOYANG"
          },
          {
            "id": "612",
            "value": "HULUDAO"
          },
          {
            "id": "10023",
            "value": "XINGCHENG"
          },
          {
            "id": "10070",
            "value": "HAICHENG"
          },
          {
            "id": "10080",
            "value": "CHANGTU"
          },
          {
            "id": "10144",
            "value": "KAIYUAN"
          }
        ]
      },
      {
        "id": "536",
        "value": "JILIN",
        "sub": [
          {
            "id": "613",
            "value": "CHANGCHUN"
          },
          {
            "id": "614",
            "value": "JILINSHI"
          },
          {
            "id": "615",
            "value": "SIPING"
          },
          {
            "id": "616",
            "value": "LIAOYUAN"
          },
          {
            "id": "617",
            "value": "TONGHUA"
          },
          {
            "id": "618",
            "value": "BAISHAN"
          },
          {
            "id": "619",
            "value": "SONGYUAN"
          },
          {
            "id": "620",
            "value": "BAICHENG"
          },
          {
            "id": "621",
            "value": "YANBIAN"
          },
          {
            "id": "10122",
            "value": "GONGZHULING"
          }
        ]
      },
      {
        "id": "539",
        "value": "JIANGSU",
        "sub": [
          {
            "id": "635",
            "value": "NANJING"
          },
          {
            "id": "639",
            "value": "SUZHOU"
          },
          {
            "id": "636",
            "value": "WUXI"
          },
          {
            "id": "640",
            "value": "KUNSHAN"
          },
          {
            "id": "650",
            "value": "CHANGSHU"
          },
          {
            "id": "652",
            "value": "ZHANGJIAGANG"
          },
          {
            "id": "651",
            "value": "JIANGYIN"
          },
          {
            "id": "637",
            "value": "XUZHOU"
          },
          {
            "id": "638",
            "value": "CHANGZHOU"
          },
          {
            "id": "641",
            "value": "NANTONG"
          },
          {
            "id": "642",
            "value": "LIANYUNGANG"
          },
          {
            "id": "643",
            "value": "HUAIAN"
          },
          {
            "id": "644",
            "value": "YANCHENG"
          },
          {
            "id": "645",
            "value": "YANGZHOU"
          },
          {
            "id": "646",
            "value": "ZHENJIANG"
          },
          {
            "id": "647",
            "value": "TAIZHOU"
          },
          {
            "id": "649",
            "value": "JINGJIANG"
          },
          {
            "id": "648",
            "value": "SUQIAN"
          },
          {
            "id": "911",
            "value": "TAICANG"
          },
          {
            "id": "10028",
            "value": "JURONG"
          },
          {
            "id": "10049",
            "value": "YIXING"
          },
          {
            "id": "10051",
            "value": "RUGAO"
          },
          {
            "id": "10114",
            "value": "DANYANG"
          },
          {
            "id": "10124",
            "value": "YANGZHONG"
          },
          {
            "id": "10126",
            "value": "GAOYOU"
          },
          {
            "id": "10136",
            "value": "QIDONG"
          },
          {
            "id": "10149",
            "value": "TAIXING"
          },
          {
            "id": "10150",
            "value": "LIYANG"
          },
          {
            "id": "10152",
            "value": "XUYI"
          },
          {
            "id": "10155",
            "value": "TONGZHOU"
          },
          {
            "id": "10175",
            "value": "JINHU"
          }
        ]
      },
      {
        "id": "544",
        "value": "SHANDONG",
        "sub": [
          {
            "id": "702",
            "value": "JINAN"
          },
          {
            "id": "703",
            "value": "QINGDAO"
          },
          {
            "id": "707",
            "value": "YANTAI"
          },
          {
            "id": "704",
            "value": "ZIBO"
          },
          {
            "id": "705",
            "value": "ZAOZHUANG"
          },
          {
            "id": "706",
            "value": "DONGYING"
          },
          {
            "id": "708",
            "value": "WEIFANG"
          },
          {
            "id": "709",
            "value": "JINING"
          },
          {
            "id": "710",
            "value": "TAIAN"
          },
          {
            "id": "711",
            "value": "WEIHAI"
          },
          {
            "id": "712",
            "value": "RIZHAO"
          },
          {
            "id": "713",
            "value": "LAIWU"
          },
          {
            "id": "714",
            "value": "LINYI"
          },
          {
            "id": "715",
            "value": "DEZHOU"
          },
          {
            "id": "716",
            "value": "LIAOCHENG"
          },
          {
            "id": "717",
            "value": "BINZHOU"
          },
          {
            "id": "718",
            "value": "HEZE"
          },
          {
            "id": "912",
            "value": "RONGCHENG"
          },
          {
            "id": "10026",
            "value": "HUANGDAO"
          },
          {
            "id": "10060",
            "value": "RUSHAN"
          },
          {
            "id": "10096",
            "value": "CHENGYANG"
          },
          {
            "id": "10097",
            "value": "JIMO"
          },
          {
            "id": "10099",
            "value": "FEICHENG"
          },
          {
            "id": "10116",
            "value": "YANZHOU"
          },
          {
            "id": "10146",
            "value": "HAIYANG"
          },
          {
            "id": "10156",
            "value": "JIAOZHOU"
          },
          {
            "id": "10172",
            "value": "JIAONAN"
          },
          {
            "id": "10173",
            "value": "PINGDU"
          },
          {
            "id": "10174",
            "value": "LAIXI"
          }
        ]
      },
      {
        "id": "540",
        "value": "ZHEJIANG",
        "sub": [
          {
            "id": "653",
            "value": "HANGZHOU"
          },
          {
            "id": "654",
            "value": "NINGBO"
          },
          {
            "id": "655",
            "value": "WENZHOU"
          },
          {
            "id": "656",
            "value": "JIAXING"
          },
          {
            "id": "657",
            "value": "HUZHOU"
          },
          {
            "id": "658",
            "value": "SHAOXING"
          },
          {
            "id": "659",
            "value": "JINHUA"
          },
          {
            "id": "660",
            "value": "QUZHOU"
          },
          {
            "id": "661",
            "value": "ZHOUSHAN"
          },
          {
            "id": "662",
            "value": "TAIZHOU"
          },
          {
            "id": "663",
            "value": "LISHUI"
          },
          {
            "id": "909",
            "value": "YUHUANXIAN"
          },
          {
            "id": "10004",
            "value": "YIWU"
          },
          {
            "id": "10052",
            "value": "PINGHU"
          },
          {
            "id": "10055",
            "value": "YONGKANG"
          },
          {
            "id": "10056",
            "value": "DONGYANG"
          },
          {
            "id": "10067",
            "value": "JIASHAN"
          },
          {
            "id": "10085",
            "value": "YUYAO"
          },
          {
            "id": "10086",
            "value": "CIXI"
          },
          {
            "id": "10089",
            "value": "LEQING"
          },
          {
            "id": "10091",
            "value": "YONGJIA"
          },
          {
            "id": "10127",
            "value": "TONGXIANG"
          },
          {
            "id": "10128",
            "value": "RUIAN"
          },
          {
            "id": "10129",
            "value": "WENLING"
          },
          {
            "id": "10130",
            "value": "SHANGYU"
          },
          {
            "id": "10131",
            "value": "ZHUJI"
          },
          {
            "id": "10133",
            "value": "HAINING"
          },
          {
            "id": "10134",
            "value": "NINGHAI"
          },
          {
            "id": "10145",
            "value": "SANMEN"
          },
          {
            "id": "10151",
            "value": "DEQING"
          },
          {
            "id": "10154",
            "value": "XIANGSHAN"
          },
          {
            "id": "10158",
            "value": "FANGJIASHAN"
          },
          {
            "id": "10180",
            "value": "LONGQUAN"
          }
        ]
      },
      {
        "id": "549",
        "value": "GUANGXI",
        "sub": [
          {
            "id": "785",
            "value": "NANNING"
          },
          {
            "id": "786",
            "value": "LIUZHOU"
          },
          {
            "id": "787",
            "value": "GUILIN"
          },
          {
            "id": "788",
            "value": "WUZHOU"
          },
          {
            "id": "789",
            "value": "BEIHAI"
          },
          {
            "id": "790",
            "value": "FANGCHENGGANG"
          },
          {
            "id": "791",
            "value": "QINZHOU"
          },
          {
            "id": "792",
            "value": "GUIGANG"
          },
          {
            "id": "793",
            "value": "YULIN"
          },
          {
            "id": "794",
            "value": "BAISE"
          },
          {
            "id": "795",
            "value": "HEZHOU"
          },
          {
            "id": "796",
            "value": "HECHI"
          },
          {
            "id": "904",
            "value": "LAIBIN"
          },
          {
            "id": "905",
            "value": "CHONGZUO"
          }
        ]
      },
      {
        "id": "541",
        "value": "ANHUI",
        "sub": [
          {
            "id": "664",
            "value": "HEFEI"
          },
          {
            "id": "665",
            "value": "WUHU"
          },
          {
            "id": "666",
            "value": "BENGBU"
          },
          {
            "id": "667",
            "value": "HUAINAN"
          },
          {
            "id": "668",
            "value": "MAANSHAN"
          },
          {
            "id": "669",
            "value": "HUAIBEI"
          },
          {
            "id": "670",
            "value": "TONGLING"
          },
          {
            "id": "671",
            "value": "ANQING"
          },
          {
            "id": "672",
            "value": "HUANGSHAN"
          },
          {
            "id": "673",
            "value": "CHUZHOU"
          },
          {
            "id": "674",
            "value": "FUYANG"
          },
          {
            "id": "675",
            "value": "SUZHOU"
          },
          {
            "id": "676",
            "value": "CHAOHU"
          },
          {
            "id": "677",
            "value": "LIUAN"
          },
          {
            "id": "678",
            "value": "BOZHOU"
          },
          {
            "id": "679",
            "value": "CHIZHOU"
          },
          {
            "id": "680",
            "value": "XUANCHENG"
          },
          {
            "id": "10069",
            "value": "FENGYANG"
          },
          {
            "id": "10181",
            "value": "GUANGDE"
          },
          {
            "id": "10182",
            "value": "SUSONG"
          }
        ]
      },
      {
        "id": "532",
        "value": "HEBEI",
        "sub": [
          {
            "id": "565",
            "value": "SHIJIAZHUANG"
          },
          {
            "id": "566",
            "value": "TANGSHAN"
          },
          {
            "id": "567",
            "value": "QINHUANGDAO"
          },
          {
            "id": "568",
            "value": "HANDAN"
          },
          {
            "id": "569",
            "value": "XINGTAI"
          },
          {
            "id": "570",
            "value": "BAODING"
          },
          {
            "id": "571",
            "value": "ZHANGJIAKOU"
          },
          {
            "id": "572",
            "value": "CHENGDE"
          },
          {
            "id": "573",
            "value": "CANGZHOU"
          },
          {
            "id": "574",
            "value": "LANGFANG"
          },
          {
            "id": "575",
            "value": "HENGSHUI"
          },
          {
            "id": "10050",
            "value": "YANJIAO"
          },
          {
            "id": "10142",
            "value": "GUAN"
          },
          {
            "id": "10143",
            "value": "ZUNHUA"
          },
          {
            "id": "10167",
            "value": "XIANGHE"
          },
          {
            "id": "10170",
            "value": "SANHE"
          }
        ]
      },
      {
        "id": "533",
        "value": "SHANXI",
        "sub": [
          {
            "id": "576",
            "value": "TAIYUAN"
          },
          {
            "id": "577",
            "value": "DATONG"
          },
          {
            "id": "578",
            "value": "YANGQUAN"
          },
          {
            "id": "579",
            "value": "CHANGZHI"
          },
          {
            "id": "580",
            "value": "JINCHENG"
          },
          {
            "id": "581",
            "value": "SHUOZHOU"
          },
          {
            "id": "582",
            "value": "JINZHONG"
          },
          {
            "id": "583",
            "value": "YUNCHENG"
          },
          {
            "id": "584",
            "value": "XINZHOU"
          },
          {
            "id": "585",
            "value": "LINFEN"
          },
          {
            "id": "586",
            "value": "LVLIANG"
          },
          {
            "id": "910",
            "value": "YONGJI"
          },
          {
            "id": "10082",
            "value": "HESHUN"
          }
        ]
      },
      {
        "id": "534",
        "value": "NEIMENGGU",
        "sub": [
          {
            "id": "587",
            "value": "HUHEHAOTE"
          },
          {
            "id": "588",
            "value": "BAOTOU"
          },
          {
            "id": "589",
            "value": "WUHAI"
          },
          {
            "id": "590",
            "value": "CHIFENG"
          },
          {
            "id": "591",
            "value": "TONGLIAO"
          },
          {
            "id": "592",
            "value": "EERDUOSI"
          },
          {
            "id": "593",
            "value": "HULUNBEIER"
          },
          {
            "id": "594",
            "value": "XINGAN"
          },
          {
            "id": "595",
            "value": "XILINGUOLE"
          },
          {
            "id": "596",
            "value": "WULANCHABU"
          },
          {
            "id": "597",
            "value": "BAYANNAOER"
          },
          {
            "id": "598",
            "value": "ALASHAN"
          },
          {
            "id": "10031",
            "value": "WUSHENQI"
          },
          {
            "id": "10157",
            "value": "MANZHOULI"
          }
        ]
      },
      {
        "id": "537",
        "value": "HEILONGJIANG",
        "sub": [
          {
            "id": "622",
            "value": "HAERBIN"
          },
          {
            "id": "623",
            "value": "QIQIHAER"
          },
          {
            "id": "624",
            "value": "JIXI"
          },
          {
            "id": "625",
            "value": "HEGANG"
          },
          {
            "id": "626",
            "value": "SHUANGYASHAN"
          },
          {
            "id": "627",
            "value": "DAQING"
          },
          {
            "id": "628",
            "value": "YICHUN"
          },
          {
            "id": "629",
            "value": "JIAMUSI"
          },
          {
            "id": "630",
            "value": "QITAIHE"
          },
          {
            "id": "631",
            "value": "MUDANJIANG"
          },
          {
            "id": "632",
            "value": "HEIHE"
          },
          {
            "id": "633",
            "value": "SUIHUA"
          },
          {
            "id": "634",
            "value": "DAXINGANLING"
          },
          {
            "id": "10081",
            "value": "ANDA"
          },
          {
            "id": "10159",
            "value": "SHUANGCHENG"
          },
          {
            "id": "10160",
            "value": "SHANGZHI"
          },
          {
            "id": "10161",
            "value": "SUIFENHE"
          },
          {
            "id": "10510",
            "value": "ZHAODONGSHI"
          }
        ]
      },
      {
        "id": "542",
        "value": "FUJIAN",
        "sub": [
          {
            "id": "681",
            "value": "FUZHOU"
          },
          {
            "id": "682",
            "value": "XIAMEN"
          },
          {
            "id": "683",
            "value": "PUTIAN"
          },
          {
            "id": "684",
            "value": "SANMING"
          },
          {
            "id": "685",
            "value": "QUANZHOU"
          },
          {
            "id": "686",
            "value": "QUANGANG"
          },
          {
            "id": "687",
            "value": "ZHANGZHOU"
          },
          {
            "id": "688",
            "value": "NANPING"
          },
          {
            "id": "689",
            "value": "LONGYAN"
          },
          {
            "id": "690",
            "value": "NINGDE"
          },
          {
            "id": "10020",
            "value": "FUAN"
          },
          {
            "id": "10148",
            "value": "JINJIANG"
          }
        ]
      },
      {
        "id": "543",
        "value": "JIANGXI",
        "sub": [
          {
            "id": "691",
            "value": "NANCHANG"
          },
          {
            "id": "692",
            "value": "JINGDEZHEN"
          },
          {
            "id": "693",
            "value": "PINGXIANG"
          },
          {
            "id": "694",
            "value": "JIUJIANG"
          },
          {
            "id": "695",
            "value": "XINYU"
          },
          {
            "id": "696",
            "value": "YINGTAN"
          },
          {
            "id": "697",
            "value": "GANZHOU"
          },
          {
            "id": "698",
            "value": "JIAN"
          },
          {
            "id": "699",
            "value": "YICHUN"
          },
          {
            "id": "700",
            "value": "FUZHOU"
          },
          {
            "id": "701",
            "value": "SHANGRAO"
          }
        ]
      },
      {
        "id": "545",
        "value": "HENAN",
        "sub": [
          {
            "id": "719",
            "value": "ZHENGZHOU"
          },
          {
            "id": "720",
            "value": "KAIFENG"
          },
          {
            "id": "721",
            "value": "LUOYANG"
          },
          {
            "id": "722",
            "value": "PINGDINGSHAN"
          },
          {
            "id": "723",
            "value": "ANYANG"
          },
          {
            "id": "724",
            "value": "HEBI"
          },
          {
            "id": "725",
            "value": "XINXIANG"
          },
          {
            "id": "726",
            "value": "JIAOZUO"
          },
          {
            "id": "727",
            "value": "PUYANG"
          },
          {
            "id": "728",
            "value": "XUCHANG"
          },
          {
            "id": "729",
            "value": "LUOHE"
          },
          {
            "id": "730",
            "value": "SANMENXIA"
          },
          {
            "id": "731",
            "value": "NANYANG"
          },
          {
            "id": "732",
            "value": "SHANGQIU"
          },
          {
            "id": "733",
            "value": "XINYANG"
          },
          {
            "id": "734",
            "value": "ZHOUKOU"
          },
          {
            "id": "735",
            "value": "ZHUMADIAN"
          },
          {
            "id": "10044",
            "value": "JIYUAN"
          },
          {
            "id": "10059",
            "value": "XIPING"
          },
          {
            "id": "10137",
            "value": "CHANGGE"
          }
        ]
      },
      {
        "id": "547",
        "value": "HUNAN",
        "sub": [
          {
            "id": "749",
            "value": "CHANGSHA"
          },
          {
            "id": "750",
            "value": "ZHUZHOU"
          },
          {
            "id": "751",
            "value": "XIANGTAN"
          },
          {
            "id": "752",
            "value": "HENGYANG"
          },
          {
            "id": "753",
            "value": "SHAOYANG"
          },
          {
            "id": "754",
            "value": "YUEYANG"
          },
          {
            "id": "755",
            "value": "CHANGDE"
          },
          {
            "id": "756",
            "value": "ZHANGJIAJIE"
          },
          {
            "id": "757",
            "value": "YIYANG"
          },
          {
            "id": "758",
            "value": "CHENZHOU"
          },
          {
            "id": "759",
            "value": "YONGZHOU"
          },
          {
            "id": "760",
            "value": "HUAIHUA"
          },
          {
            "id": "761",
            "value": "LOUDI"
          },
          {
            "id": "762",
            "value": "XIANGXI"
          }
        ]
      },
      {
        "id": "550",
        "value": "HAINAN",
        "sub": [
          {
            "id": "799",
            "value": "HAIKOU"
          },
          {
            "id": "800",
            "value": "SANYA"
          },
          {
            "id": "907",
            "value": "YANGPU"
          },
          {
            "id": "10153",
            "value": "QIONGHAI"
          },
          {
            "id": "10183",
            "value": "DANZHOU"
          },
          {
            "id": "10184",
            "value": "WUZHISHAN"
          },
          {
            "id": "10185",
            "value": "WENCHANG"
          },
          {
            "id": "10186",
            "value": "WANNING"
          },
          {
            "id": "10187",
            "value": "DONGFANG"
          },
          {
            "id": "10188",
            "value": "ANDING"
          },
          {
            "id": "10189",
            "value": "TUNCHANG"
          },
          {
            "id": "10190",
            "value": "CHENGMAI"
          },
          {
            "id": "10191",
            "value": "LINGAO"
          },
          {
            "id": "10192",
            "value": "QIONGZHONGLIZUMIAOZUZIZHI"
          },
          {
            "id": "10193",
            "value": "BAOTINGLIZUMIAOZUZIZHI"
          },
          {
            "id": "10194",
            "value": "BAISHALIZUZIZHI"
          },
          {
            "id": "10195",
            "value": "CHANGJIANGLIZUZIZHI"
          },
          {
            "id": "10196",
            "value": "LEDONGLIZUZIZHI"
          },
          {
            "id": "10197",
            "value": "LINGSHUILIZUZIZHI"
          },
          {
            "id": "10303",
            "value": "SANSHA"
          }
        ]
      },
      {
        "id": "553",
        "value": "GUIZHOU",
        "sub": [
          {
            "id": "822",
            "value": "GUIYANG"
          },
          {
            "id": "823",
            "value": "LIUPANSHUI"
          },
          {
            "id": "824",
            "value": "ZUNYI"
          },
          {
            "id": "825",
            "value": "ANSHUN"
          },
          {
            "id": "826",
            "value": "TONGREN"
          },
          {
            "id": "827",
            "value": "QIANXINAN"
          },
          {
            "id": "828",
            "value": "BIJIE"
          },
          {
            "id": "829",
            "value": "QIANDONGNAN"
          },
          {
            "id": "830",
            "value": "QIANNAN"
          }
        ]
      },
      {
        "id": "554",
        "value": "YUNNAN",
        "sub": [
          {
            "id": "831",
            "value": "KUNMING"
          },
          {
            "id": "832",
            "value": "QUJING"
          },
          {
            "id": "833",
            "value": "YUXI"
          },
          {
            "id": "834",
            "value": "BAOSHAN"
          },
          {
            "id": "835",
            "value": "ZHAOTONG"
          },
          {
            "id": "836",
            "value": "CHUXIONG"
          },
          {
            "id": "837",
            "value": "HONGHE"
          },
          {
            "id": "838",
            "value": "WENSHAN"
          },
          {
            "id": "839",
            "value": "SIMAO"
          },
          {
            "id": "840",
            "value": "XISHUANGBANNA"
          },
          {
            "id": "841",
            "value": "DALI"
          },
          {
            "id": "842",
            "value": "DEHONG"
          },
          {
            "id": "843",
            "value": "LIJIANG"
          },
          {
            "id": "844",
            "value": "NUJIANG"
          },
          {
            "id": "845",
            "value": "DIQING"
          },
          {
            "id": "846",
            "value": "LINCANG"
          },
          {
            "id": "10163",
            "value": "PUER"
          }
        ]
      },
      {
        "id": "555",
        "value": "TIBET",
        "sub": [
          {
            "id": "847",
            "value": "LASA"
          },
          {
            "id": "848",
            "value": "CHANGDU"
          },
          {
            "id": "849",
            "value": "SHANNAN"
          },
          {
            "id": "850",
            "value": "RIKEZE"
          },
          {
            "id": "851",
            "value": "NAQU"
          },
          {
            "id": "852",
            "value": "ALI"
          },
          {
            "id": "853",
            "value": "LINZHI"
          }
        ]
      },
      {
        "id": "557",
        "value": "GANSU",
        "sub": [
          {
            "id": "864",
            "value": "LANZHOU"
          },
          {
            "id": "865",
            "value": "JIAYUGUAN"
          },
          {
            "id": "866",
            "value": "JINCHANG"
          },
          {
            "id": "867",
            "value": "BAIYIN"
          },
          {
            "id": "868",
            "value": "TIANSHUI"
          },
          {
            "id": "869",
            "value": "WUWEI"
          },
          {
            "id": "870",
            "value": "ZHANGYE"
          },
          {
            "id": "871",
            "value": "PINGLIANG"
          },
          {
            "id": "872",
            "value": "JIUQUAN"
          },
          {
            "id": "873",
            "value": "QINGYANG"
          },
          {
            "id": "874",
            "value": "DINGXI"
          },
          {
            "id": "875",
            "value": "LONGNAN"
          },
          {
            "id": "876",
            "value": "LINXIA"
          },
          {
            "id": "877",
            "value": "GANNAN"
          }
        ]
      },
      {
        "id": "558",
        "value": "QINGHAI",
        "sub": [
          {
            "id": "878",
            "value": "XINING"
          },
          {
            "id": "879",
            "value": "HAIDONG"
          },
          {
            "id": "880",
            "value": "HAIBEI"
          },
          {
            "id": "881",
            "value": "HUANGNAN"
          },
          {
            "id": "882",
            "value": "HAINAN"
          },
          {
            "id": "883",
            "value": "GUOLUO"
          },
          {
            "id": "884",
            "value": "YUSHU"
          },
          {
            "id": "885",
            "value": "HAIXI"
          }
        ]
      },
      {
        "id": "559",
        "value": "NINGXIA",
        "sub": [
          {
            "id": "886",
            "value": "YINCHUAN"
          },
          {
            "id": "887",
            "value": "SHIZUISHAN"
          },
          {
            "id": "888",
            "value": "WUZHONG"
          },
          {
            "id": "889",
            "value": "GUYUAN"
          },
          {
            "id": "906",
            "value": "ZHONGWEI"
          }
        ]
      },
      {
        "id": "560",
        "value": "XINJIANG",
        "sub": [
          {
            "id": "890",
            "value": "WULUMUQI"
          },
          {
            "id": "891",
            "value": "KELAMAYI"
          },
          {
            "id": "892",
            "value": "TULUFAN"
          },
          {
            "id": "893",
            "value": "HAMI"
          },
          {
            "id": "894",
            "value": "CHANGJI"
          },
          {
            "id": "895",
            "value": "BOERTALA"
          },
          {
            "id": "896",
            "value": "BAYINGUOLENG"
          },
          {
            "id": "897",
            "value": "AKESU"
          },
          {
            "id": "898",
            "value": "KEZILESUKEERKEZI"
          },
          {
            "id": "899",
            "value": "KESHEN"
          },
          {
            "id": "900",
            "value": "HETIAN"
          },
          {
            "id": "901",
            "value": "YILI"
          },
          {
            "id": "902",
            "value": "TACHENG"
          },
          {
            "id": "903",
            "value": "ALETAI"
          },
          {
            "id": "10061",
            "value": "SHIHEZI"
          },
          {
            "id": "10164",
            "value": "KUITUNSHI"
          },
          {
            "id": "10166",
            "value": "WUSU"
          },
          {
            "id": "10176",
            "value": "ALAER"
          },
          {
            "id": "10177",
            "value": "TUMUSHUKE"
          },
          {
            "id": "10178",
            "value": "WUJIAQU"
          },
          {
            "id": "10300",
            "value": "BEITUN"
          },
          {
            "id": "10301",
            "value": "SHUANGHE"
          },
          {
            "id": "10302",
            "value": "TIEMENGUAN"
          }
        ]
      },
      {
        "id": "561",
        "value": "HONGKONG"
      },
      {
        "id": "562",
        "value": "MACAO"
      },
      {
        "id": "563",
        "value": "TAIWAN",
        "sub": [
          {
            "id": "10304",
            "value": "TAIBEI"
          }
        ]
      }
    ]
  },
  {
    "id": "0",
    "value": "OVERSEAS",
    "sub": [
      {
        "id": "480",
        "value": "OVERSEAS"
      },
      {
        "id": "481",
        "value": "Argentina"
      },
      {
        "id": "482",
        "value": "Australia"
      },
      {
        "id": "483",
        "value": "Austria"
      },
      {
        "id": "484",
        "value": "Belarus"
      },
      {
        "id": "485",
        "value": "Belgium"
      },
      {
        "id": "486",
        "value": "Brazil"
      },
      {
        "id": "487",
        "value": "Bulgaria"
      },
      {
        "id": "488",
        "value": "Canada"
      },
      {
        "id": "490",
        "value": "Cyprus"
      },
      {
        "id": "491",
        "value": "Czech Republic"
      },
      {
        "id": "492",
        "value": "Denmark"
      },
      {
        "id": "493",
        "value": "Egypt"
      },
      {
        "id": "494",
        "value": "Finland"
      },
      {
        "id": "495",
        "value": "France"
      },
      {
        "id": "496",
        "value": "Germany"
      },
      {
        "id": "497",
        "value": "Greece"
      },
      {
        "id": "498",
        "value": "Hungary"
      },
      {
        "id": "499",
        "value": "Iceland"
      },
      {
        "id": "500",
        "value": "India"
      },
      {
        "id": "501",
        "value": "Indonesia"
      },
      {
        "id": "502",
        "value": "Ireland"
      },
      {
        "id": "503",
        "value": "Israel"
      },
      {
        "id": "504",
        "value": "Italy"
      },
      {
        "id": "505",
        "value": "Japan"
      },
      {
        "id": "506",
        "value": "Korea (South)"
      },
      {
        "id": "507",
        "value": "Kuwait"
      },
      {
        "id": "508",
        "value": "Malaysia"
      },
      {
        "id": "509",
        "value": "Netherlands"
      },
      {
        "id": "510",
        "value": "New Zealand"
      },
      {
        "id": "511",
        "value": "Norway"
      },
      {
        "id": "513",
        "value": "Pakistan"
      },
      {
        "id": "514",
        "value": "Poland"
      },
      {
        "id": "515",
        "value": "Portugal"
      },
      {
        "id": "516",
        "value": "Russian Federation"
      },
      {
        "id": "517",
        "value": "Saudi Arabia"
      },
      {
        "id": "518",
        "value": "Singapore"
      },
      {
        "id": "519",
        "value": "South Africa"
      },
      {
        "id": "520",
        "value": "Spain"
      },
      {
        "id": "521",
        "value": "Sweden"
      },
      {
        "id": "522",
        "value": "Switzerland"
      },
      {
        "id": "523",
        "value": "Thailand"
      },
      {
        "id": "524",
        "value": "Turkey"
      },
      {
        "id": "525",
        "value": "Ukraine"
      },
      {
        "id": "526",
        "value": "United Arab Emirates"
      },
      {
        "id": "527",
        "value": "United Kingdom"
      },
      {
        "id": "528",
        "value": "United States"
      },
      {
        "id": "529",
        "value": "Vietnam"
      },
      {
        "id": "913",
        "value": "Angola"
      },
      {
        "id": "914",
        "value": "Ghana"
      },
      {
        "id": "915",
        "value": "Nigeria"
      },
      {
        "id": "916",
        "value": "Tanzania"
      },
      {
        "id": "917",
        "value": "Uganda"
      },
      {
        "id": "918",
        "value": "Algeria"
      },
      {
        "id": "919",
        "value": "Senegal"
      },
      {
        "id": "925",
        "value": "Lebanon"
      },
      {
        "id": "512",
        "value": "Other"
      },
      {
        "id": "942",
        "value": "Venezuela"
      },
      {
        "id": "922",
        "value": "Columbia"
      },
      {
        "id": "928",
        "value": "Slovenia"
      },
      {
        "id": "931",
        "value": "Chile"
      },
      {
        "id": "939",
        "value": "Peru"
      },
      {
        "id": "923",
        "value": "Kazakhstan"
      },
      {
        "id": "934",
        "value": "Bahrain"
      },
      {
        "id": "940",
        "value": "Serbia"
      },
      {
        "id": "926",
        "value": "Lithuania"
      },
      {
        "id": "920",
        "value": "Esthonia"
      },
      {
        "id": "937",
        "value": "Rumania"
      },
      {
        "id": "943",
        "value": "Iraq"
      },
      {
        "id": "938",
        "value": "Bangladesh"
      },
      {
        "id": "929",
        "value": "Uruguay"
      },
      {
        "id": "941",
        "value": "Sri Lanka"
      },
      {
        "id": "935",
        "value": "Puerto Rico"
      },
      {
        "id": "927",
        "value": "Mexico"
      },
      {
        "id": "921",
        "value": "Philippines"
      },
      {
        "id": "944",
        "value": "Jordan"
      },
      {
        "id": "930",
        "value": "Iran"
      },
      {
        "id": "936",
        "value": "Qatar"
      },
      {
        "id": "924",
        "value": "Croatia"
      },
      {
        "id": "933",
        "value": "Azerbaijan"
      }
    ]
  }
];
var hotCity_en = [{
  "id": "489",
  "value": "China",
  "sub": [{
    "id": "530",
    "value": "BEIJING"
  }, {
    "id": "538",
    "value": "SHANGHAI"
  }, {
    "id": "531",
    "value": "TIANJIN"
  }, {
    "id": "551",
    "value": "CHONGQING"
  }]
}, {
  "id": "548",
  "value": "GUANGDONG",
  "sub": [{
    "id": "763",
    "value": "GUANGZHOU"
  }, {
    "id": "765",
    "value": "SHENZHEN"
  }, {
    "id": "773",
    "value": "HUIZHOU"
  }, {
    "id": "768",
    "value": "FOSHAN"
  }]
}, {
  "id": "546",
  "value": "HUBEI",
  "sub": [{
    "id": "736",
    "value": "WUHAN"
  }]
}, {
  "id": "556",
  "value": "SHANXI",
  "sub": [{
    "id": "854",
    "value": "XIAN"
  }]
}, {
  "id": "552",
  "value": "SICHUAN",
  "sub": [{
    "id": "801",
    "value": "CHENGDU"
  }]
}, {
  "id": "535",
  "value": "LIAONING",
  "sub": [{
    "id": "600",
    "value": "DALIAN"
  }, {
    "id": "599",
    "value": "SHENYANG"
  }]
}, {
  "id": "536",
  "value": "JILIN",
  "sub": [{
    "id": "613",
    "value": "CHANGCHUN"
  }]
}, {
  "id": "539",
  "value": "JIANGSU",
  "sub": [{
    "id": "635",
    "value": "NANJING"
  }, {
    "id": "639",
    "value": "SUZHOU"
  }, {
    "id": "636",
    "value": "WUXI"
  }]
}, {
  "id": "544",
  "value": "SHANDONG",
  "sub": [{
    "id": "702",
    "value": "JINAN"
  }, {
    "id": "703",
    "value": "QINGDAO"
  }, {
    "id": "707",
    "value": "YANTAI"
  }]
}, {
  "id": "540",
  "value": "ZHEJIANG",
  "sub": [{
    "id": "653",
    "value": "HANGZHOU"
  }, {
    "id": "654",
    "value": "NINGBO"
  }]
}, {
  "id": "545",
  "value": "HENAN",
  "sub": [{
    "id": "719",
    "value": "ZHENGZHOU"
  }]
}, {
  "id": "547",
  "value": "HUNAN",
  "sub": [{
    "id": "749",
    "value": "CHANGSHA"
  }]
}, {
  "id": "542",
  "value": "FUJIAN",
  "sub": [{
    "id": "681",
    "value": "FUZHOU"
  }, {
    "id": "682",
    "value": "XIAMEN"
  }]
}, {
  "id": "537",
  "value": "HEILONGJIANG",
  "sub": [{
    "id": "622",
    "value": "HAERBIN"
  }]
}, {
  "id": "532",
  "value": "HEBEI",
  "sub": [{
    "id": "565",
    "value": "SHIJIAZHUANG"
  }]
}, {
  "id": "541",
  "value": "ANHUI",
  "sub": [{
    "id": "664",
    "value": "HEFEI"
  }]
}, {
  "id": "533",
  "value": "SHANXI",
  "sub": [{
    "id": "576",
    "value": "TAIYUAN"
  }]
}, {
  "id": "554",
  "value": "YUNNAN",
  "sub": [{
    "id": "831",
    "value": "KUNMING"
  }]
}, {
  "id": "543",
  "value": "JIANGXI",
  "sub": [{
    "id": "691",
    "value": "NANCHANG"
  }]
}, {
  "id": "553",
  "value": "GUIZHOU",
  "sub": [{
    "id": "822",
    "value": "GUIYANG"
  }]
}];


export default city;